#Найти расстояние между двумя точками пространства
def task3():
    x1 = int(input('Введите Х1: '))
    y1 = int(input('Введите Y1: '))
    z1 = int(input('Введите Z1: '))
    x2 = int(input('Введите Х2: '))
    y2 = int(input('Введите Y2: '))
    z2 = int(input('Введите Z2: '))
    dist = ((x1- x2) * (x1- x2) + (y1 - y2) * (y1 - y2) + (z1 - z2) * (z1 - z2)) ** 0.5
    print(f'Расстояние между точками ({x1},{y1},{z1}) и ({x2},{y2},{z2}) равно {dist}')

#Можно доработать так:
def task3_v2():
    x1, y1, z1 = list(map(int, input('Введите через пробел координаты первой точки').split()))
    x2, y2, z2 = list(map(int, input('Введите через пробел координаты второй точки').split()))
    dist = ((x1- x2) * (x1- x2) + (y1 - y2) * (y1 - y2) + (z1 - z2) * (z1 - z2)) ** 0.5
    print(f'Расстояние между точками ({x1},{y1},{z1}) и ({x2},{y2},{z2}) равно {dist}')

task3_v2()